test/smp-test/38unit/38unit-160th.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.4.1">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="AWS Smart Planner Microservices" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <stringProp name="TestPlan.comments">'22년 AWS Public Cloud 전환 프로젝트 단위 성능 테스트</stringProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="SMP_HOST" elementType="Argument">
            <stringProp name="Argument.name">SMP_HOST</stringProp>
            <stringProp name="Argument.value">smp.sktelecom.com</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="SMP_PORT" elementType="Argument">
            <stringProp name="Argument.name">SMP_PORT</stringProp>
            <stringProp name="Argument.value">443</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="SMPS_HOST" elementType="Argument">
            <stringProp name="Argument.name">SMPS_HOST</stringProp>
            <stringProp name="Argument.value">smps.sktelecom.com</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="SMPS_PORT" elementType="Argument">
            <stringProp name="Argument.name">SMPS_PORT</stringProp>
            <stringProp name="Argument.value">443</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="AWS_SMP_HOST" elementType="Argument">
            <stringProp name="Argument.name">AWS_SMP_HOST</stringProp>
            <stringProp name="Argument.value">smpaws.sktelecom.com</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="AWS_SMP_PORT" elementType="Argument">
            <stringProp name="Argument.name">AWS_SMP_PORT</stringProp>
            <stringProp name="Argument.value">443</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="AWS_SMPS_HOST" elementType="Argument">
            <stringProp name="Argument.name">AWS_SMPS_HOST</stringProp>
            <stringProp name="Argument.value">smpsaws.sktelecom.com</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="AWS_SMPS_PORT" elementType="Argument">
            <stringProp name="Argument.name">AWS_SMPS_PORT</stringProp>
            <stringProp name="Argument.value">443</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="Variables pr�-d�finies" enabled="true">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">${SMP_HOST}</stringProp>
        <stringProp name="HTTPSampler.port">${SMP_PORT}</stringProp>
        <stringProp name="HTTPSampler.protocol">https</stringProp>
        <stringProp name="HTTPSampler.concurrentPool">6</stringProp>
      </ConfigTestElement>
      <hashTree/>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json;charset=UTF-8</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Accept-Encoding</stringProp>
            <stringProp name="Header.value">gzip, deflate, br</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">auth</stringProp>
            <stringProp name="Header.value">skip</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <kg.apc.jmeter.threads.UltimateThreadGroup guiclass="kg.apc.jmeter.threads.UltimateThreadGroupGui" testclass="kg.apc.jmeter.threads.UltimateThreadGroup" testname="TS_TOT_02_02" enabled="true">
        <collectionProp name="ultimatethreadgroupdata">
          <collectionProp name="1966791593">
            <stringProp name="1603">160</stringProp>
            <stringProp name="1567">10</stringProp>
            <stringProp name="1567">10</stringProp>
            <stringProp name="50547">300</stringProp>
            <stringProp name="10">10</stringProp>
          </collectionProp>
        </collectionProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <stringProp name="TestPlan.comments">Aurora DB 저장 이벤트 로그 저장 단독</stringProp>
      </kg.apc.jmeter.threads.UltimateThreadGroup>
      <hashTree>
        <GaussianRandomTimer guiclass="GaussianRandomTimerGui" testclass="GaussianRandomTimer" testname="Gaussian Random Timer" enabled="true">
          <stringProp name="ConstantTimer.delay">300</stringProp>
          <stringProp name="RandomTimer.range">100.0</stringProp>
        </GaussianRandomTimer>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="IMSPJ00038:ZSMPSCOM10010_TR01" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{
 
    "input1": [
 
        {
 
            "add_info_memo": "{\"cust_num\":\"8032666640\",\"ci\":\"S3fklrOc7pZlHdls/BxILmf92yHolFh5a4ALcJo16fajcUyc0dLmA0j1cDCzKp+T7qgEnpZWKxgDPuEfDtprRA==\",\"prod_id\":\"\"}",
 
            "conn_eqp_typ_cd": "IS",
 
            "odm_trms_dtm": "20220316135959",
 
            "qstn_req_ser_num": "",
 
            "sale_org_id": "7000000153",
 
            "scrn_id": "ZSMPSCSC10010",
 
            "smplnr_strd_grp_id": "F07",
 
            "smplnr_strd_id": "D1",
 
            "sup_sale_org_id": "C099710000",
 
            "svc_mgmt_num": "1992934216",
 
            "svc_num": "01022080370",
 
            "svc_pgm_id": "SMPSCOM10010T01",
 
            "add_eqp_mdl_cd_trms_ctt": "",
 
            "allot_calr_pra_cl_cd": "03",
 
            "allot_calr_use_yn": "",
 
            "bar_cd_num": "",
 
            "btv_prod_id_trms_ctt": "",
 
            "card_pay_amt_trms_ctt": "",
 
            "cprod_itm_cd_trms_ctt": "",
 
            "dbm_trms_ser_num": "",
 
            "eqp_mdl_nm_trms_ctt": "IPHONE_12_PRO_128GB",
 
            "fax_img_num": "",
 
            "fee_prod_id_trms_ctt": "NA00006404",
 
            "inet_prod_id_trms_ctt": "",
 
            "prom_prod_id_trms_ctt": "",
 
            "req_trms_dtm": "",
 
            "scrb_typ_cd": "C1",
 
            "simul_id": "",
 
            "supl_ppln_prod_id_trms_ctt": "",
 
            "wphon_prod_id_trms_ctt": "",
 
            "flag": "C"
 
        }
 
    ],
 
    "HEAD": {
 
        "Trx_Code": "/smtp-smp-evtsvr/api/v1/IMSPJ00038",
 
        "Ngms_UserId": "1001036988",
 
        "Ngms_LogInId": "UX168",
 
        "Ngms_EmpNum": "1",
 
        "Ngms_OrgId": "1",
 
        "Ngms_HrOrgCd": "1",
 
        "Ngms_PostOrgCd": "1",
 
        "Ngms_PostSaleOrgCd": "1",
 
        "Ngms_SupSaleOrgCd": "1",
 
        "Ngms_IpAddr": "1",
 
        "Ngms_BrTypCd": "1",
 
        "Ngms_AuthId": "1",
 
        "Ngms_ConnOrgId": "A000700000",
 
        "Ngms_ConnOrgCd": "A000700000",
 
        "Ngms_ConnSaleOrgId": "A000700000",
 
        "Ngms_ConnSaleOrgCd": "A000700000",
 
        "Ngms_AuthTypPermCd": "EQ",
 
        "Ngms_PostSaleOrgId": "A000700000",
 
        "Ngms_SupSaleOrgId": "A010890000",
 
        "Term_Type": "0",
 
        "User_Term_Type": "",
 
        "St_Stop": "0",
 
        "St_Trace": "",
 
        "Stx_Dt": "",
 
        "Stx_Tm": "",
 
        "Etx_Dt": "",
 
        "Etx_Tm": "",
 
        "Rt_Cd": "",
 
        "Screen_Name": "ZSMPSCFO00010",
 
        "Msg_Cnt": "0",
 
        "Handle_Id": "703744926 ",
 
        "Ngms_Filler1": "",
 
        "Ngms_CoClCd": "T",
 
        "Screen_Call_Trace": "m:ZSMPSCSC10010-m:ZSMPSCSC10010-/smtp-smp-evtsvr/api/v1/IMSPJ00038",
 
        "Pgm_Typ_Cd": "",
 
        "rowStatus": "C"
 
    }
 
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/smtp-smp-evtsvr/api/v1/IMSPJ00038</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="TestPlan.comments">판매상담활용이력저장</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="IMSPJ00038:ZSMPSCOM10020_TR01" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{
 
    "input1": [
 
        {
 
            "smplnr_strd_grp_id": "O05",
 
            "smplnr_strd_id": "D6",
 
            "svc_num": "01022080370",
 
            "svc_mgmt_num": "1992934216",
 
            "add_info_memo": "",
 
            "scrn_id": "ZSMPSCSC10010",
 
            "eqp_mdl_cd": "A3XH",
 
            "cvnc_func_memo_ctt": "NA00006404,NA00007301,,,,,,,,,,,,,,,,,,",
 
            "flag": "C",
 
            "audit_id": "1000964278",
 
            "sale_org_id": "1000009295",
 
            "sup_sale_org_id": "B099920000",
 
            "conn_eqp_typ_cd": "PC",
 
            "svc_pgm_id": "SMPSCOM10020T01",
 
            "scrb_typ_cd": "",
 
            "rowStatus": "R"
 
        }
 
    ],
 
    "HEAD": {
 
        "Trx_Code": "/smtp-smp-evtsvr/api/v1/IMSPJ00038",
 
        "Ngms_UserId": "1000964278",
 
        "Ngms_LogInId": "SCP03",
 
        "Ngms_EmpNum": "",
 
        "Ngms_OrgId": "1000009294",
 
        "Ngms_HrOrgCd": "",
 
        "Ngms_PostOrgCd": "D00066A000",
 
        "Ngms_PostSaleOrgCd": "D00066A000",
 
        "Ngms_SupSaleOrgCd": "C099920000",
 
        "Ngms_IpAddr": "150.20.18.205",
 
        "Ngms_BrTypCd": "500",
 
        "Ngms_AuthId": "",
 
        "Ngms_ConnOrgId": "1000009295",
 
        "Ngms_ConnOrgCd": "D00066",
 
        "Ngms_ConnSaleOrgId": "1000009295",
 
        "Ngms_ConnSaleOrgCd": "D00066",
 
        "Ngms_AuthTypPermCd": "EQ",
 
        "Ngms_PostSaleOrgId": "1000009294",
 
        "Ngms_SupSaleOrgId": "B099920000",
 
        "Term_Type": "0",
 
        "User_Term_Type": "",
 
        "St_Stop": "0",
 
        "St_Trace": "",
 
        "Stx_Dt": "",
 
        "Stx_Tm": "",
 
        "Etx_Dt": "",
 
        "Etx_Tm": "",
 
        "Rt_Cd": "",
 
        "Screen_Name": "ZSMPSCSC10010",
 
        "Msg_Cnt": "0",
 
        "Handle_Id": "898660918 ",
 
        "Ngms_Filler1": "",
 
        "Ngms_CoClCd": "T",
 
        "Screen_Call_Trace": "m:ZSMPSCSC10010-m:ZSMPSCSC10010-/smtp-smp-evtsvr/api/v1/IMSPJ00038",
 
        "Pgm_Typ_Cd": "008",
 
        "Ngms_TbAgentInfo": "",
 
        "Ngms_TbAuthInfo": "",
 
        "rowStatus": "C"
 
    }
 
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/smtp-smp-evtsvr/api/v1/IMSPJ00038</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="TestPlan.comments">추천상품활용이력저장</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="IMSPJ00038:ZSMPSCOM10030_TR01" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{
 
    "input1": [
 
        {
 
            "smplnr_strd_grp_id": "DT",
 
            "smplnr_strd_id": "00",
 
            "svc_num": "",
 
            "svc_mgmt_num": "",
 
            "add_info_memo": "",
 
            "scrn_id": "ZSMPSCOM11010",
 
            "cntnts_ser_num": "1650522396394",
 
            "cntnts_tit_nm": "갤럭시 퀀텀3",
 
            "cntnts_typ_cd": "EQP",
 
            "prod_cd": "A3XH",
 
            "prod_nm": "SM-M536S",
 
            "flag": "C",
 
            "audit_id": "1000964278",
 
            "sale_org_id": "1000009295",
 
            "sup_sale_org_id": "B099920000",
 
            "conn_eqp_typ_cd": "PC",
 
            "svc_pgm_id": "SMPSCOM10030T01",
 
            "scrb_typ_cd": "",
 
            "mac_addr": "",
 
            "rowStatus": "R"
 
        }
 
    ],
 
    "HEAD": {
 
        "Trx_Code": "/smtp-smp-evtsvr/api/v1/IMSPJ00038",
 
        "Ngms_UserId": "1000964278",
 
        "Ngms_LogInId": "SCP03",
 
        "Ngms_EmpNum": "",
 
        "Ngms_OrgId": "1000009294",
 
        "Ngms_HrOrgCd": "",
 
        "Ngms_PostOrgCd": "D00066A000",
 
        "Ngms_PostSaleOrgCd": "D00066A000",
 
        "Ngms_SupSaleOrgCd": "C099920000",
 
        "Ngms_IpAddr": "150.20.18.205",
 
        "Ngms_BrTypCd": "500",
 
        "Ngms_AuthId": "",
 
        "Ngms_ConnOrgId": "1000009295",
 
        "Ngms_ConnOrgCd": "D00066",
 
        "Ngms_ConnSaleOrgId": "1000009295",
 
        "Ngms_ConnSaleOrgCd": "D00066",
 
        "Ngms_AuthTypPermCd": "EQ",
 
        "Ngms_PostSaleOrgId": "1000009294",
 
        "Ngms_SupSaleOrgId": "B099920000",
 
        "Term_Type": "0",
 
        "User_Term_Type": "",
 
        "St_Stop": "0",
 
        "St_Trace": "",
 
        "Stx_Dt": "",
 
        "Stx_Tm": "",
 
        "Etx_Dt": "",
 
        "Etx_Tm": "",
 
        "Rt_Cd": "",
 
        "Screen_Name": "ZSMPSCSC10010",
 
        "Msg_Cnt": "0",
 
        "Handle_Id": "898660918 ",
 
        "Ngms_Filler1": "",
 
        "Ngms_CoClCd": "T",
 
        "Screen_Call_Trace": "m:ZSMPSCSC10010-m:ZSMPSCSC10010-/smtp-smp-evtsvr/api/v1/IMSPJ00038",
 
        "Pgm_Typ_Cd": "008",
 
        "Ngms_TbAgentInfo": "",
 
        "Ngms_TbAuthInfo": "",
 
        "rowStatus": "C"
 
    }
 
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/smtp-smp-evtsvr/api/v1/IMSPJ00038</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="TestPlan.comments">상담컨텐츠활용이력저장</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.TransactionsPerSecondGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Transactions per Second" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <longProp name="interval_grouping">1000</longProp>
          <boolProp name="graph_aggregated">false</boolProp>
          <boolProp name="include_checkbox_state">false</boolProp>
          <boolProp name="exclude_checkbox_state">false</boolProp>
        </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
        <hashTree/>
        <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.ResponseTimesOverTimeGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Response Times Over Time" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <longProp name="interval_grouping">1000</longProp>
          <boolProp name="graph_aggregated">false</boolProp>
          <boolProp name="include_checkbox_state">false</boolProp>
          <boolProp name="exclude_checkbox_state">false</boolProp>
        </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
        <hashTree/>
        <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>